{
  "aries": {
    "sun_sign": "Aries represents the pure energy of creation and new beginnings. As the first sign of the zodiac, Aries embodies initiative, courage, and leadership. This fire sign's core traits include independence, assertiveness, and a pioneering spirit. Aries individuals are natural leaders who thrive on challenges and taking action.",
    "sun_sign_medium": "As the first sign of the zodiac, Aries embodies the dynamic energy of new beginnings. You are an activist and doer with an adventurous spirit, always eager to plunge into new endeavors with irresistible enthusiasm. Your natural leadership qualities, self-confidence, and optimism draw others to you, though your patience can be notoriously short-lived. Independence is your keyword—you prefer to run the whole show rather than take orders from anyone else.\n\nYour Aries nature is marked by courage, honesty, and generosity, though these qualities are sometimes overshadowed by impulsiveness and a tendency to speak without thinking. You possess remarkable resilience; no force can break your combative spirit except yourself. While you can be self-involved and occasionally tactless, there's no malice in your actions—just the pure, unfiltered expression of your innate force and enthusiasm for life.",
    "moon_sign": "Your emotional nature is direct and passionate. You process feelings quickly and express them openly. Independence is crucial to your emotional well-being, and you need freedom to pursue your own interests. While you can be impulsive, your emotional honesty and courage are admirable.",
    "rising_sign": "You project confidence and enthusiasm. Your presence is dynamic and engaging, often making you the natural leader in social situations. While you can be direct and assertive, your warmth and spontaneity make you approachable. You're known for your initiative and ability to take charge.",
    "sun_sign_long": "Aries is the first sign of the zodiac, the sign that symbolizes new beginnings. It connotes quick changes and sudden forks in the road. Your life is marked by arriving at a certain place and then being turned in a new direction. Certainly, one can say your life is adventurous! There is a dynamic restlessness to the Aries character. With the Sun in this sign, you are an activist and doer. If you have a new plan or idea — if an enterprise strikes your fancy — you can't wait to plunge right in. The amusing little prayer, \"Grant me patience NOW!\" is typical of the Arien attitude. When others first meet you their instant impression is of someone exciting, vibrant, talkative. Others will be lucky if they can get a word in edgewise. If someone brings up a topic, you will be delighted to tell in great detail exactly what you think about it. As an Aries person you gravitate toward the center of action. You are audacious and intent on getting your own way. Since your nature is to express power, you treat opposition as an annoyance to be brushed out of the way. You are a natural leader who exudes self-confidence. From an early age you feel you are headed for success. Happily, you are also generous about helping others in a crisis. You are an openhearted friend who shares ideas and advice, and likes to pick up the check. You have a quality of largesse. You are not interested in the small or petty. \"Go for the best\" is your motto. There is nothing faint or half-hearted about an Arien. Whereas others may be more cautious, you actually enjoy living on the edge. A touch of recklessness makes you feel alive. The chase is always more thrilling than getting the goal. (As one Aries recently remarked rather insightfully, \"Wanting is always better than getting.\") You are willing to take a gamble, follow a dream, set your mind on a goal, and pursue it with irresistible enthusiasm. Your supreme quality of optimism attracts others. Underneath there may lurk insecurity, but no one will ever know about it. This is not to say you don't get depressed or moody. But the winter of despair doesn't last a week with Aries. You have an uncrackable optimism. It is true, however, that Aries people are notorious for taking offense at fancied slights and injuries. Hot tempers and childish tantrums abound, and your threshold of boredom is extremely low. If success is not immediate, you tend to lose interest and go in search of other excitement. As a result, patient, plodding types often get to the head of the class before you do. Ariens have a well-deserved reputation for not finishing what they have begun. You are very short of patience, and your lack of stick-to-itiveness is your weak spot. Also, you spend your energy in too many different ways, like the Ring Lardner hero who mounted a horse and rode off in all directions at once. Independence is a keyword. You can turn sulky and peevish if you have to take orders. You would much rather be the world's largest lizard than the world's smallest dragon. You want to run the whole show. If you can't, you pull up stakes and look for a situation in which you can show off your style and brilliance. Should you come up against a superior force, you will bend but never break. Your aggressive and combative spirit cannot be broken by anyone — except yourself. One of the pitfalls of being an Aries is that you're essentially self-involved. Unless you make an effort to look outward at others and their feelings, you can easily become a spoiled brat. Though generally sincere and honest, you will tell a white lie if it seems advantageous. You are not a very adept liar, however; others see right through you. Sometimes you lack tact and diplomacy, but no malice is intended. Sagittarians also lack this quality of tact because they don't know how to be oblique or roundabout. With you, tactlessness is an impulsive act — a careless expression of your innate force. Too often you speak without thinking and say whatever pops into your mouth, and usually regret your impulsiveness later. Aries is lucky with money, but has trouble holding on to it. You tend to run up big bills, live extravagantly, soar over budget. However, you usually find a way to pay off what you owe. You have too much pride to remain in anyone's debt. In friendship you give magnanimously if someone is in need, but you want to get credit for your good deeds. In the garden of Aries, there are few shrinking violets. You are creative, openhearted, high-spirited, pioneering, also vain, feisty, and impatient. Those who deal with you on an intimate basis will have one chief problem: How are they going to keep up the pace?",
    "moon_sign_long": "You like to be in charge — you want to control your own projects and plans and not be under anyone else's thumb. You have an intense drive to succeed and put a lot of pressure on yourself. Inside, you're filled with nervous energy and worry about how you're going to handle everything. You hate to be bored; you're always looking for something different — new people and places that promise excitement and adventure. You have very little patience; you need to practice sticking things out. You're also impatient with people who can't resolve a problem. You believe in taking action. What you do have are great generosity and enthusiasm. And although you suffer from occasional self-doubt, you know that if you really want to do something, you can!",
    "rising_sign_long": "Your upbeat, magnetic personality pulls people toward you — you bring excitement into their lives. They envy your aggressiveness in meeting a challenge. Whatever the problem, you give the impression that you have an answer ready. You're also admired for your honesty; you don't gloss over difficulties. What people don't like is your tendency toward bossiness and your deserved reputation for being sharp-tongued. They're afraid to cross you in an argument because they know you can cut them to the quick."
  },
  "taurus": {
    "sun_sign": "Taurus embodies stability, practicality, and determination. As an earth sign, Taurus represents material security, sensuality, and steadfastness. This sign's core traits include reliability, patience, and a strong connection to physical pleasures. Taurus individuals are known for their persistence and appreciation of beauty.",
    "sun_sign_medium": "Taurus is the embodiment of stability and form, the builder who creates with deliberate care. You possess a deep appreciation for beauty and material comfort, naturally drawn to life's sensual pleasures—fine food, art, music, and tangible luxury. Practical and persistent, you approach life with steady determination, preferring tried-and-true methods over theoretical speculation.\n\nYour fixed earth nature grants you remarkable dependability and patience, though this same quality manifests as legendary stubbornness when challenged. Like a mountain, you can be immovable once your mind is set. This steadfast quality makes you utterly reliable, but can also render you resistant to change even when flexibility would serve you better. Your greatest strengths lie in your practical approach to wealth-building and your unshakeable persistence toward your goals.",
    "moon_sign": "Your emotional nature is steady and grounded. You seek security and comfort in your relationships and surroundings. While you can be slow to change, your loyalty and dependability are unwavering. You process feelings methodically and value stability in your emotional life.",
    "rising_sign": "You project calmness and reliability. Your presence is soothing and reassuring to others. While you can be stubborn, your practical approach and steady demeanor make you a trusted confidant. You're known for your patience and ability to create a sense of security.",
    "sun_sign_long": "Taurus is the sign of stability, the sign that represents the establishment of order and form. You are a builder who constructs with care and deliberation. You are also a lover of beauty and material comfort. You are drawn to the good things in life — fine food, wine, music, art, and sensual pleasures. You have a gift for working with your hands and a talent for accumulating wealth. You are practical and persistent, and once you make up your mind to accomplish something you stick to it. You are not interested in theory or speculation. You want to know what is going to work, and once you find a method that works you do not want to change it. You are stable, solid, and utterly dependable. You are also stubborn, unbending, and nearly immovable when you dig in your heels. You are a fixed earth sign, and you can be as immovable as a mountain. You are not interested in change for its own sake. You want to know what is going to work, and once you find a method that works you do not want to change it. You are stable, solid, and utterly dependable. You are also stubborn, unbending, and nearly immovable when you dig in your heels. You are a fixed earth sign, and you can be as immovable as a mountain. You are not interested in change for its own sake. You want to know what is going to work, and once you find a method that works you do not want to change it. You are stable, solid, and utterly dependable. You are also stubborn, unbending, and nearly immovable when you dig in your heels.",
    "moon_sign_long": "You have a strong need for security and comfort. You are very sensitive to your surroundings and need a peaceful, harmonious environment. You are also very sensitive to food and may have a tendency to overeat when under stress. You have a strong need for physical contact and affection. You are very loyal and devoted to those you love. You have a strong need for stability and routine in your life. You are very resistant to change and may become quite upset when your routine is disrupted.",
    "rising_sign_long": "You project an image of stability and reliability. Others see you as someone they can count on. You have a strong physical presence and may be quite attractive in a sensual way. You move slowly and deliberately, and you speak in a measured, thoughtful way. You have a natural dignity and grace that others admire. You may have a tendency to be stubborn and inflexible, but you are also very patient and persistent."
  },
  "gemini": {
    "sun_sign": "Gemini represents duality, communication, and intellectual curiosity. As an air sign, Gemini embodies adaptability, wit, and social interaction. This sign's core traits include versatility, quick thinking, and a love of learning. Gemini individuals are known for their ability to connect ideas and people.",
    "sun_sign_medium": "Gemini embodies the essence of duality and communication, the messenger who connects ideas and people with effortless versatility. You possess a quick, curious mind and a natural gift for words that captivates those around you. Adaptable and intellectually nimble, you can change course with remarkable ease, though this same quality can manifest as restlessness when not properly channeled.\n\nYour life requires mental variety and constant stimulation to thrive. A natural teacher and eternal student, you move through life with a youthful energy that never truly fades. While your wit and charm are undeniable assets, your challenge lies in developing focus and consistency—learning to channel your scattered brilliance into sustained achievement rather than dispersing your considerable talents across too many simultaneous interests.",
    "moon_sign": "Your emotional nature is curious and adaptable. You process feelings through communication and intellectual understanding. While you can be inconsistent, your ability to see multiple perspectives is valuable. You need mental stimulation and variety in your emotional life.",
    "rising_sign": "You project intelligence and charm. Your presence is light and engaging, making you naturally sociable. While you can be scattered, your wit and versatility make you fascinating to others. You're known for your ability to adapt to any social situation.",
    "sun_sign_long": "Gemini is the sign of duality, the sign of the twins. You are a communicator, a messenger, a connector of ideas and people. You are curious about everything and everyone. You have a quick mind and a gift for words. You are adaptable and versatile, able to change direction quickly when necessary. You are also restless and easily bored. You need variety and stimulation in your life. You are interested in many different things and may have trouble focusing on just one area. You are a natural teacher and student, always learning and sharing what you know. You have a youthful quality that stays with you throughout your life. You are witty and charming, and you have a way with words that can captivate others. You are also somewhat scattered and may have trouble following through on your commitments. You need to learn to focus your energy and develop more stability and consistency in your life.",
    "moon_sign_long": "You process emotions through your mind, analyzing and thinking about your feelings rather than simply experiencing them. You need mental stimulation and variety in your emotional life. You may have difficulty dealing with deep emotions because you tend to intellectualize them. You are very adaptable and can adjust to almost any situation. You need to learn to trust your feelings and not just your thoughts.",
    "rising_sign_long": "You project an image of intelligence and adaptability. Others see you as someone who is quick-witted and versatile. You have a youthful appearance and manner that stays with you throughout your life. You move quickly and speak rapidly, often gesturing with your hands as you talk. You have a natural curiosity about others and may ask lots of questions. You may appear somewhat scattered or nervous to others."
  },
  "cancer": {
    "sun_sign": "Cancer represents nurturing, emotional depth, and home. As a water sign, Cancer embodies intuition, protection, and family bonds. This sign's core traits include sensitivity, loyalty, and a strong connection to tradition. Cancer individuals are known for their caring nature and emotional intelligence.",
    "sun_sign_medium": "Cancer embodies the nurturing force of emotional connection and protection. You possess a profound sensitivity that allows you to intuitively understand others' needs, creating environments where people feel safe, cared for, and truly at home. Your deep emotional intelligence is matched by a powerful connection to family, tradition, and all that provides security in an uncertain world.\n\nYour protective nature can manifest as both fierce loyalty and a defensive self-preservation that sometimes puzzles those who don't understand your emotional complexity. While your moodiness ebbs and flows like the tides governed by your ruling Moon, your compassion remains constant. Your greatest strength lies in your ability to create genuine emotional bonds that withstand time's test, nurturing others while honoring your own need for meaningful connection and belonging.",
    "moon_sign": "Your emotional nature is deeply sensitive and intuitive. You process feelings through nurturing and emotional connection. While you can be moody, your empathy and understanding are profound. You need emotional security and close relationships to feel fulfilled.",
    "rising_sign": "You project warmth and protectiveness. Your presence is nurturing and comforting to others. While you can be defensive, your emotional intelligence and caring nature make you approachable. You're known for your ability to create a sense of home and belonging."
  },
  "leo": {
    "sun_sign": "Leo represents creativity, leadership, and self-expression. As a fire sign, Leo embodies confidence, generosity, and charisma. This sign's core traits include pride, warmth, and a desire for recognition. Leo individuals are known for their dramatic flair and natural leadership abilities.",
    "sun_sign_medium": "Leo embodies the brilliant energy of creative self-expression and natural leadership. You possess an innate need to share your unique gifts with the world, approaching life with dignity, warmth, and a flair for drama that commands attention. Your generous heart and sunny disposition create an irresistible magnetism that draws others into your orbit.\n\nBeneath your confident exterior lies a genuine need for appreciation and recognition—sincere acknowledgment of your contributions can elevate your spirit, while feeling overlooked can wound your considerable pride. Your natural leadership abilities stem from your capacity to inspire rather than demand, igniting enthusiasm in others through your own passionate conviction. At your best, you transform ordinary moments into opportunities for joy, creativity, and heartfelt connection.",
    "moon_sign": "Your emotional nature is warm and generous. You process feelings through creative expression and recognition. While you can be prideful, your loyalty and generosity are remarkable. You need appreciation and opportunities to shine in your emotional life.",
    "rising_sign": "You project charisma and confidence. Your presence is magnetic and inspiring to others. While you can be dramatic, your warmth and generosity make you beloved. You're known for your ability to bring joy and creativity to any situation.",
    "sun_sign_long": "Leo is the sign of creative self-expression, the sign of the performer and the natural leader. You have a strong need to express yourself and to be recognized for your unique talents and abilities. You are proud and dignified, with a natural sense of drama and showmanship. You have a generous heart and a warm, sunny disposition. You are also somewhat egocentric and may have difficulty seeing things from others' perspectives. You need attention and appreciation, and you can become quite hurt if you feel ignored or unappreciated. You have a natural flair for drama and may have artistic talents. You are also a natural leader with the ability to inspire others with your enthusiasm and confidence.",
    "moon_sign_long": "You have a strong need for recognition and appreciation. Your emotions are dramatic and intense, and you express them with flair. You need to feel special and important in your emotional relationships. You have a generous heart and give freely of your love and affection. You may have difficulty handling criticism or rejection, as your pride is easily wounded.",
    "rising_sign_long": "You project an image of confidence and dignity. Others see you as someone who is proud and somewhat dramatic. You have a natural presence that draws attention to you. You move with grace and authority, and you speak with conviction. You may have a tendency to be somewhat theatrical in your self-expression. You have a warm, generous manner that others find attractive."
  },
  "virgo": {
    "sun_sign": "Virgo represents service, analysis, and practical intelligence. As an earth sign, Virgo embodies efficiency, organization, and attention to detail. This sign's core traits include precision, helpfulness, and a desire for improvement. Virgo individuals are known for their analytical minds and dedication to service.",
    "sun_sign_medium": "Virgo embodies the principle of service and continuous improvement, approaching life with analytical precision and practical efficiency. You possess a natural eye for detail that allows you to see flaws and imperfections others miss, not to criticize but to perfect and refine. Your methodical nature thrives on order and routine, finding purpose in creating systems that work with maximum efficiency.\n\nWhile your high standards can sometimes manifest as self-criticism or worry when conditions aren't ideal, this same quality drives your exceptional competence and reliability. Your greatest gifts lie in your healing capacity—whether through practical problem-solving, meticulous organization, or attentive care. Behind your sometimes reserved exterior lies a genuine desire to be of use, applying your considerable analytical talents toward making tangible improvements in both your life and the lives of those you touch.",
    "moon_sign": "Your emotional nature is analytical and practical. You process feelings through service and problem-solving. While you can be critical, your helpfulness and attention to detail are valuable. You need order and purpose in your emotional life.",
    "rising_sign": "You project competence and helpfulness. Your presence is organized and efficient. While you can be reserved, your practical approach and attention to detail make you reliable. You're known for your ability to improve and perfect any situation.",
    "sun_sign_long": "Virgo is the sign of service and self-improvement, the sign of the perfectionist and the analyst. You have a strong need to be useful and to make improvements in whatever you do. You are practical and efficient, with an eye for detail and a talent for analysis. You are also somewhat critical and may have difficulty accepting things or people who don't meet your high standards. You need order and routine in your life, and you can become quite anxious when things are chaotic or disorganized. You have a natural talent for work that requires attention to detail and analytical ability. You are also a natural helper and may be drawn to healing or service professions.",
    "moon_sign_long": "You have a strong need for order and efficiency in your emotional life. You process feelings through analysis and may try to find practical solutions to emotional issues. You are somewhat reserved in expressing emotions and may appear cool or detached to others. You need to feel useful and productive to be emotionally satisfied. You may be overly critical of yourself and others.",
    "rising_sign_long": "You project an image of competence and efficiency. Others see you as someone who is practical and analytical. You have a somewhat reserved manner and may appear shy or modest. You move with precision and pay attention to details. You may have a tendency to appear critical or perfectionist to others. You have a neat, well-groomed appearance and a concern for health and cleanliness."
  },
  "libra": {
    "sun_sign": "Libra represents balance, harmony, and relationships. As an air sign, Libra embodies diplomacy, fairness, and social grace. This sign's core traits include charm, justice, and a desire for partnership. Libra individuals are known for their ability to create harmony and see multiple perspectives.",
    "sun_sign_medium": "Libra embodies the principle of balance and harmony, approaching life with diplomatic grace and a refined aesthetic sensibility. You possess a natural ability to see all sides of any situation, bringing fairness and perspective to even the most contentious circumstances. Your appreciation for beauty extends beyond the superficial to encompass a deep understanding of the harmony that underlies truly balanced relationships and environments.\n\nYour gift for understanding multiple viewpoints, while valuable, can sometimes manifest as indecision when faced with choices that require commitment to a single path. Partnership is essential to your nature—you find your fullest expression not in isolation but through meaningful connection with others. At your best, you create bridges of understanding between opposing forces, transforming conflict into cooperation through your natural gift for finding the path of greatest harmony.",
    "moon_sign": "Your emotional nature is diplomatic and balanced. You process feelings through relationships and harmony. While you can be indecisive, your fairness and charm are admirable. You need partnership and beauty in your emotional life.",
    "rising_sign": "You project grace and charm. Your presence is balanced and harmonious. While you can be superficial, your diplomatic skills and sense of fairness make you well-liked. You're known for your ability to bring balance to any situation.",
    "sun_sign_long": "Libra is the sign of balance and harmony, the sign of the diplomat and the peacemaker. You have a strong need for harmony and beauty in your life, and you are naturally diplomatic and cooperative. You have a refined aesthetic sense and appreciate beauty in all its forms. You are also somewhat indecisive and may have difficulty making choices. You see all sides of an issue and can understand different perspectives, which makes it hard to take a firm stand. You need relationships and partnerships to feel complete, and you have a natural talent for bringing people together and creating harmony.",
    "moon_sign_long": "You have a strong need for harmony and balance in your emotional life. You process feelings through relationship and interaction with others. You are diplomatic and try to maintain peace in your emotional connections. You may have difficulty making emotional decisions because you can see multiple perspectives. You need beauty and refinement in your environment to feel emotionally satisfied.",
    "rising_sign_long": "You project an image of grace and charm. Others see you as someone who is diplomatic and refined. You have a natural elegance and sense of balance. You move with grace and speak with tact and consideration. You may have a tendency to appear indecisive to others. You have an attractive appearance and a concern for beauty and harmony in your presentation."
  },
  "scorpio": {
    "sun_sign": "Scorpio represents transformation, power, and emotional depth. As a water sign, Scorpio embodies intensity, mystery, and regeneration. This sign's core traits include passion, determination, and psychological insight. Scorpio individuals are known for their emotional power and ability to transform situations.",
    "sun_sign_medium": "Scorpio embodies the principle of transformation and profound emotional insight, approaching life with intensity and an uncompromising search for truth. You possess a penetrating mind capable of seeing beyond facades to the underlying motivations and hidden realities that others miss. This psychological acuity gives you extraordinary power in understanding human nature—both others' and your own.\n\nBeneath your controlled exterior runs a deep current of emotional intensity that you carefully manage but never fully suppress. Your capacity for radical personal transformation is unmatched; like your symbol the scorpion, you can regenerate and emerge stronger from life's most challenging circumstances. While you may guard your trust closely, those who earn it discover your remarkable loyalty and emotional depth. Your greatest strength lies not just in surviving life's depths but in emerging from them with wisdom, power, and profound understanding.",
    "moon_sign": "Your emotional nature is intense and transformative. You process feelings through deep emotional experiences. While you can be secretive, your emotional depth and insight are profound. You need emotional intensity and transformation in your life.",
    "rising_sign": "You project mystery and power. Your presence is magnetic and intense. While you can be intimidating, your emotional depth and determination make you fascinating. You're known for your ability to transform and regenerate situations.",
    "sun_sign_long": "Scorpio is the sign of transformation and regeneration, the sign of the investigator and the psychologist. You have a penetrating mind and a powerful will. You are intensely curious about the hidden side of life and have a natural talent for investigation and research. You are also somewhat secretive and may have difficulty trusting others. You have strong emotions that you keep carefully controlled, but when you do express them, they can be quite intense. You have a natural understanding of human psychology and can see through people's facades to their true motivations.",
    "moon_sign_long": "You have deep, intense emotions that you often keep hidden from others. You process feelings through deep psychological understanding and transformation. You are somewhat private about your emotional life and need time alone to process your feelings. You have powerful intuition and can sense others' hidden emotions. You may have difficulty trusting others emotionally.",
    "rising_sign_long": "You project an image of mystery and intensity. Others see you as someone who is deep and somewhat secretive. You have a penetrating gaze and a powerful presence. You move with controlled intensity and speak with conviction. You may have a tendency to appear somewhat intimidating to others. You have a magnetic quality that others find both attractive and somewhat unsettling."
  },
  "sagittarius": {
    "sun_sign": "Sagittarius represents adventure, philosophy, and expansion. As a fire sign, Sagittarius embodies optimism, freedom, and truth-seeking. This sign's core traits include enthusiasm, honesty, and a love of learning. Sagittarius individuals are known for their adventurous spirit and philosophical nature.",
    "sun_sign_medium": "Sagittarius embodies the spirit of adventure and philosophical exploration, approaching life with boundless optimism and a thirst for expanding horizons. You possess a natural enthusiasm that makes even ordinary experiences feel like adventures and a straightforward honesty that cuts through pretense to reveal underlying truths. Your expansive vision allows you to see possibilities beyond conventional limitations.\n\nFreedom is essential to your nature—you require the space to follow your curiosity wherever it leads, whether across physical landscapes or intellectual territories. While your restlessness can sometimes manifest as difficulty with details or commitment, this same quality fuels your remarkable ability to inspire others through teaching and sharing your broad perspective. Your greatest gift lies in your capacity to transform knowledge into wisdom and to illuminate life's larger meaning through your naturally philosophical approach to experience.",
    "moon_sign": "Your emotional nature is optimistic and adventurous. You process feelings through exploration and understanding. While you can be blunt, your enthusiasm and honesty are refreshing. You need freedom and growth in your emotional life.",
    "rising_sign": "You project optimism and enthusiasm. Your presence is adventurous and inspiring. While you can be reckless, your honesty and sense of adventure make you exciting. You're known for your ability to expand horizons and seek truth.",
    "sun_sign_long": "Sagittarius is the sign of the seeker and the philosopher, the sign of adventure and expansion. You have a strong need for freedom and independence, and you are naturally optimistic and enthusiastic. You are interested in big ideas and broad perspectives, and you have a natural talent for seeing the larger picture. You are also somewhat restless and may have difficulty staying in one place or focusing on details. You need adventure and new experiences to feel alive, and you have a natural talent for teaching and sharing your knowledge with others.",
    "moon_sign_long": "You have a strong need for freedom and space in your emotional life. You process feelings through philosophical understanding and seeking meaning. You are optimistic and enthusiastic in your emotional expression. You may have difficulty with emotional commitment because you need independence. You need adventure and new experiences to feel emotionally satisfied.",
    "rising_sign_long": "You project an image of optimism and enthusiasm. Others see you as someone who is adventurous and philosophical. You have a natural exuberance and a love of freedom. You move with energy and speak with conviction about your beliefs. You may have a tendency to appear somewhat careless or scattered to others. You have an open, friendly manner that others find inspiring."
  },
  "capricorn": {
    "sun_sign": "Capricorn represents ambition, responsibility, and achievement. As an earth sign, Capricorn embodies discipline, practicality, and long-term planning. This sign's core traits include determination, reliability, and a strong work ethic. Capricorn individuals are known for their ability to achieve goals through persistence.",
    "sun_sign_medium": "Capricorn embodies the principle of disciplined achievement and structured ambition, approaching life with a pragmatic determination that builds lasting foundations. You possess natural organizational abilities and a talent for creating systems and structures that endure the test of time. Your practical nature sees obstacles not as barriers but as challenges to be methodically overcome through persistent effort.\n\nBeneath your sometimes serious exterior lies a deep need to make meaningful progress toward your carefully considered goals. While you may approach pleasure and relaxation with the same disciplined attitude you bring to work, your capacity for patient, steadfast effort yields rewards that more impulsive signs seldom attain. Your greatest strength lies in your ability to accept responsibility, maintain your commitments through difficulties, and transform long-term vision into tangible achievement through the powerful alchemy of disciplined effort and practical wisdom.",
    "moon_sign": "Your emotional nature is disciplined and responsible. You process feelings through achievement and structure. While you can be reserved, your reliability and determination are admirable. You need accomplishment and security in your emotional life.",
    "rising_sign": "You project authority and competence. Your presence is professional and reliable. While you can be cold, your discipline and ambition make you respected. You're known for your ability to achieve and maintain long-term success.",
    "sun_sign_long": "Capricorn is the sign of ambition and achievement, the sign of the builder and the organizer. You have a strong need to achieve and succeed, and you are naturally practical and responsible. You have excellent organizational abilities and a talent for building solid, lasting structures. You are also somewhat serious and may have difficulty relaxing and enjoying yourself. You need to feel that you are making progress toward your goals, and you have a natural talent for business and management. You are patient and persistent, willing to work hard and wait for results.",
    "moon_sign_long": "You have a strong need for security and structure in your emotional life. You process feelings through practical achievement and responsibility. You are somewhat reserved in expressing emotions and may appear cold or distant to others. You need to feel you are making progress and achieving goals to be emotionally satisfied. You may be hard on yourself emotionally.",
    "rising_sign_long": "You project an image of authority and competence. Others see you as someone who is serious and responsible. You have a dignified presence and a concern for status and position. You move with deliberation and speak with authority. You may have a tendency to appear somewhat stern or reserved to others. You have a professional manner that commands respect."
  },
  "aquarius": {
    "sun_sign": "Aquarius represents innovation, independence, and humanitarian ideals. As an air sign, Aquarius embodies originality, progress, and social consciousness. This sign's core traits include uniqueness, inventiveness, and a desire for freedom. Aquarius individuals are known for their forward-thinking ideas and humanitarian spirit.",
    "sun_sign_medium": "Aquarius embodies the principle of innovation and humanitarian vision, approaching life with an original perspective that transcends conventional boundaries. You possess a brilliant mind naturally attuned to future possibilities and the evolution of collective consciousness. Your independent thinking and progressive ideals give you a unique vantage point from which to envision solutions others haven't yet considered.\n\nWhile your intellectual approach to life can sometimes manifest as emotional detachment, this same quality grants you remarkable objectivity in addressing social and humanitarian concerns. You thrive in collaborative environments that value your unconventional insights, yet you require the freedom to experiment and follow your intuitive flashes of genius. Your greatest strength lies in your ability to catalyze progress through innovative thinking, uniting diverse groups around shared ideals while maintaining your essential uniqueness and intellectual freedom.",
    "moon_sign": "Your emotional nature is independent and innovative. You process feelings through intellectual understanding and social causes. While you can be detached, your originality and humanitarian spirit are inspiring. You need freedom and progress in your emotional life.",
    "rising_sign": "You project uniqueness and independence. Your presence is progressive and unconventional. While you can be eccentric, your innovative ideas and humanitarian ideals make you fascinating. You're known for your ability to bring new perspectives and social change.",
    "sun_sign_long": "Aquarius is the sign of the innovator and the humanitarian, the sign of the scientist and the reformer. You have a strong need to be unique and different, and you are naturally progressive and forward-thinking. You have an excellent mind and a talent for scientific or technological work. You are also somewhat detached and may have difficulty with close emotional connections. You need freedom to experiment and try new things, and you have a natural talent for working with groups and organizations. You are interested in making the world a better place and may be drawn to social causes.",
    "moon_sign_long": "You have a strong need for intellectual stimulation in your emotional life. You process feelings through rational understanding and humanitarian ideals. You are somewhat detached in your emotional expression and may appear cool or impersonal to others. You need freedom and space to experiment emotionally. You may have difficulty with intimate emotional connections.",
    "rising_sign_long": "You project an image of originality and independence. Others see you as someone who is unique and somewhat eccentric. You have an intellectual presence and a concern for humanitarian causes. You move with unpredictable energy and speak with conviction about your ideals. You may have a tendency to appear somewhat detached or aloof to others. You have an unconventional style that others find intriguing."
  },
  "pisces": {
    "sun_sign": "Pisces represents compassion, spirituality, and artistic expression. As a water sign, Pisces embodies intuition, empathy, and transcendence. This sign's core traits include sensitivity, creativity, and a connection to the divine. Pisces individuals are known for their artistic talents and spiritual awareness.",
    "sun_sign_medium": "Pisces embodies the mystical realm of spiritual connection and boundless compassion, approaching life with an intuitive sensitivity that perceives beyond ordinary reality. You possess a remarkable receptivity that absorbs the energies, emotions, and unspoken currents around you, giving you an almost psychic understanding of others' inner worlds. Your natural artistic gifts flow from this profound sensitivity, allowing you to translate subtle impressions into creative expression.\n\nWhile your impressionable nature can sometimes make you vulnerable to negative influences or escapism, this same quality grants you unparalleled empathy and spiritual awareness. Your greatest strength lies in your capacity to dissolve boundaries—between self and other, between material and spiritual realms—offering healing and inspiration through your natural connection to universal compassion and artistic beauty. In embracing both your worldly responsibilities and spiritual gifts, you fulfill your highest potential as the zodiac's mystic and dreamer.",
    "moon_sign": "Your emotional nature is compassionate and intuitive. You process feelings through artistic expression and spiritual connection. While you can be escapist, your empathy and creativity are profound. You need spiritual connection and artistic expression in your emotional life.",
    "rising_sign": "You project sensitivity and creativity. Your presence is gentle and artistic. While you can be elusive, your compassion and spiritual awareness make you inspiring. You're known for your ability to bring beauty and healing to any situation.",
    "sun_sign_long": "Just as the first sign of the zodiac, Aries, represents a new beginning so the twelfth and last sign, Pisces, is the end of the circle, the sign of eternity, reincarnation, and spiritual rebirth. Many astrologers say that Pisces is a link to the spirit world and that you who are born under this sign are old souls, for they believe Pisceans to have experienced other lives in the past. Pisceans have an otherworldly quality. In mystical terms, you are described as being half-body and half-spirit, pulled between material existence and spiritual concerns, possessed of the knowledge that you will never be entirely at home in the real world. Like natives of the other water signs (Cancer and Scorpio), you have the ability to see deeply into the human psyche. Subtle and intuitive, you are born with the gift of prophecy, and may even become involved in the occult, ESP, and spiritualism. Because you have a close relationship with astral forces, you feel things before you know them and your feelings are rarely wrong. If you get a hunch, others would be wise to pay attention. Part of your clairvoyance stems from the fact that you understand first with your heart, and only then do you rationalize what you know intuitively. Ruled by Neptune, planet of mystery and illusion, your personality is elusive, fey, and quicksilvery. Your element is water, and the imagery of the sea is evident in how easily you adapt to the ever-shifting currents around you. More than natives of any other sign, you are enormously influenced by your surroundings and by the people who touch your life. Indeed, you have a unique ability to get under another person's skin, to take literally as your own another's problems, joys, and woes. You have tender sympathy for anyone or anything that hurts; sick plants, hungry animals, and friends in need — they all find a home with you. At times you give away the very strength and emotional security you need for yourself. You possess superb intuitions and a seemingly bottomless understanding of other people, yet your extraordinary sensitivity can be your most vulnerable point. You are too impressionable to each passing influence, too susceptible to someone else's hard-luck story or plea for help. For you, learning to say no can be a lifetime project and you may never learn how to do it at all. Ancient astrologers called Pisces the sign of Sorrow from SelfUndoing, and you can easily become the creator of your own downfall. You are impractical and fall prey to overindulgence. You also have a penchant for picking the wrong companions. A fatal flaw in Pisces is the tendency to flee from what you don't want to deal with, and this can lead you into a world of addictive behavior. At times, your life may become so punctuated with trouble and heartache that you try desperately to escape, and then you are like Eliza jumping from ice floe to ice floe, with no clear sense of where you are headed. Your symbol, two fishes tied together swimming in opposite directions, represents conflicting emotions and desires that pull you to and fro. You must fight hard for stability, for the strength of purpose and balance needed to combat the negativity of laziness, carelessness, and emotional confusion. You need to develop a positive self-image, play on your strengths and ability to take responsibility, not let yourself fall victim to bad choices and your predilection for self-undoing. Your life lesson is to learn self-doing. Certainly, you do not lack backbone. Indeed, you are capable of great sacrifice and hard work in the service of a cause or an ideal. Intellectually you are curious and like to explore the unusual and hidden. Although you can be impractical, even lazy, you are also capable of prodigious work when you are involved in a project you truly care about. The thing is that despite the fact that you work unselfishly for others, you find it hard to be strict and disciplined with yourself. Not many natives of this sign are suited to the harsh, rough-and-tumble world of business and commerce. Pisces is the mystical sign of the poet and the dreamer, and you are more successful as a writer, musician, or artist. You're intensely imaginative and addicted to make-believe, and you strive to create a world that comes closer to your own unique vision. When you put your energy into creating fantasies, you're the most creative artist in the zodiac. Among famous Piscean creators are Pierre -Auguste Renoir, Frederic Chopin, Enrico Caruso, Vaslav Nijinsky, Rudolph Nureyev, Elizabeth Barrett Browning, and Edna St. Vincent Millay. Because you blend compassion and understanding with great verve, you exert a unique power on people whose lives touch yours. You may feel you lack self-confidence to be a leader, but you are definitely a guide, teacher, and role model to many. You are also a fey charmer and a mischievous wit who loves to laugh. Yet because you are fundamentally unsure of yourself, you prefer to work alone rather than with people. You have an instinct for finding what appears to be the easy way out, and founder in the shallows of least resistance. This is why so many talented, charming, superior natives of this sign never attain the position in life to which their gifts entitle them. You are a very special person whose sensitivity and awareness will always appeal to a select group. You are capable of high intellectual achievement and your magnetic, mysterious, engaging and delightful personality is heightened by an intriguing sense of drama. You are also loyal, unselfish, and generous, always ready to help a friend who has fallen on hard times. In fact, you often create a special kind of magic — when you concentrate on the best and reject what is ugly and meanspirited, people are likely to live up to your vision. You have a deep appreciation for the inner qualities of others; you are not concerned with the superficial and with what others see on the surface. You look at the inner soul, the essence. There is no more sensitive, perceptive friend, nor one more warmhearted, caring, devoted, and sentimental.",
    "moon_sign_long": "You absorb impressions, images, and emotions from everything around you, and then filter them through your rose-colored view of how you'd like things to be. This is not to say you cannot deal with reality — it's just that you like to think of life as an ultraromantic movie filled with happy endings and where everyone has the best possible motives. You're a big bundle of feelings. You feel intense joy and happiness when you're involved in a creative project or a loving relationship. The opposite is also true: you can suffer greater depths of sadness than most. Yet you're tougher than most people think. Push you down and you keep bouncingback like a rubber bathtub toy. You're charged with energy and get caught up in what's going on around you. Your greatest strength is in giving to others; you're always ready to help whoever needs you.",
    "rising_sign_long": "Everyone thinks you are his or her special friend, that they have your undivided attention. You're thought of as solicitous and concerned. You're also known as a sparkling social presence — witty, vivacious, and always interested in new activities. People consider you artistic and somewhat bohemian, and are impressed by your psychic sensibility. They value you as a confidant but, oddly, the more people lean on you, the weaker they think you are."
  }
} 