{
  "aries": {
    "element": "fire",
    "modality": "cardinal",
    "ruling_planet": "mars",
    "keywords": ["pioneering", "courageous", "direct", "energetic", "independent", "competitive"],
    "focus": "Self-initiation, leadership, and bold action",
    "qualities": {
      "general": "pioneering and assertive",
      "career": "leadership and initiative",
      "relationships": "passion and independence",
      "health": "vitality and energy",
      "spirituality": "spiritual courage",
      "personal_growth": "self-assertion"
    },
    "compatible_signs": ["leo", "sagittarius", "gemini", "libra", "aquarius"],
    "description": "Aries embodies the archetype of the Warrior and Pioneer—the raw, primal energy of new beginnings and self-discovery. As the first sign of the zodiac, Aries represents the initial spark of creation, bringing courage, enthusiasm, and a trailblazing spirit. Ruled by Mars, Aries possesses a dynamic, assertive approach to life, tackling challenges head-on with confidence and determination. While sometimes impatient or impulsive, Aries' greatest gifts lie in their ability to initiate action, lead with conviction, and inspire others through their authentic self-expression and fearless approach to life."
  },
  "taurus": {
    "element": "earth",
    "modality": "fixed",
    "ruling_planet": "venus",
    "keywords": ["steadfast", "sensual", "resourceful", "patient", "reliable", "appreciative"],
    "focus": "Security, values, and earthly pleasures",
    "qualities": {
      "general": "stable and sensual",
      "career": "practical and determined",
      "relationships": "loyalty and comfort",
      "health": "physical endurance",
      "spirituality": "earthly wisdom",
      "personal_growth": "self-worth"
    },
    "compatible_signs": ["virgo", "capricorn", "cancer", "pisces", "scorpio"],
    "description": "Taurus embodies the archetype of the Builder and Cultivator—the steady, grounding force that creates lasting value and beauty in the material world. As an earth sign ruled by Venus, Taurus combines practicality with sensuality, finding spiritual connection through physical experience. Taurus possesses exceptional patience, determination, and reliability, approaching life with a methodical, thoughtful stance that values quality over speed. While sometimes resistant to change or overly possessive, Taurus' greatest gifts lie in their ability to create security, appreciate life's pleasures, and build structures of enduring worth through their unwavering persistence and deep connection to the natural world."
  },
  "gemini": {
    "element": "air",
    "modality": "mutable",
    "ruling_planet": "mercury",
    "keywords": ["curious", "versatile", "communicative", "quick-witted", "adaptable", "intellectual"],
    "focus": "Information exchange, connection, and mental exploration",
    "qualities": {
      "general": "versatile and communicative",
      "career": "adaptability and learning",
      "relationships": "intellectual connection",
      "health": "nervous energy",
      "spirituality": "mental exploration",
      "personal_growth": "self-expression"
    },
    "compatible_signs": ["libra", "aquarius", "aries", "leo", "sagittarius"],
    "description": "Gemini embodies the archetype of the Messenger and Trickster—the agile, curious force that connects different realms through communication and exchange. As an air sign ruled by Mercury, Gemini represents the principle of duality and the dance between opposing perspectives. Gemini possesses a quick, adaptable intelligence, social versatility, and a perpetual youthfulness that finds wonder in everyday experiences. While sometimes scattered or inconsistent, Gemini's greatest gifts lie in their ability to facilitate communication, synthesize diverse ideas, and bring playful curiosity to life through their intellectual adaptability and skill with language and information."
  },
  "cancer": {
    "element": "water",
    "modality": "cardinal",
    "ruling_planet": "moon",
    "keywords": ["nurturing", "intuitive", "protective", "empathetic", "tenacious", "receptive"],
    "focus": "Emotional security, nurturing, and creating safe spaces",
    "qualities": {
      "general": "nurturing and protective",
      "career": "emotional intelligence",
      "relationships": "deep bonding",
      "health": "emotional well-being",
      "spirituality": "intuitive wisdom",
      "personal_growth": "emotional security"
    },
    "compatible_signs": ["scorpio", "pisces", "taurus", "virgo", "capricorn"],
    "description": "Cancer embodies the archetype of the Mother and Nurturer—the protective, intuitive force that creates emotional safety and honors ancestral connections. As a water sign ruled by the Moon, Cancer represents the ebb and flow of feelings and the sacred vessel that contains emotional life. Cancer possesses profound empathy, tenacious memory, and a nurturing spirit that instinctively responds to vulnerability. While sometimes moody or overprotective, Cancer's greatest gifts lie in their ability to create belonging, preserve heritage, and offer emotional sustenance through their intuitive understanding of human needs and their deep capacity for care."
  },
  "leo": {
    "element": "fire",
    "modality": "fixed",
    "ruling_planet": "sun",
    "keywords": ["radiant", "generous", "expressive", "dignified", "charismatic", "playful"],
    "focus": "Creative self-expression, recognition, and heart-centered leadership",
    "qualities": {
      "general": "creative and confident",
      "career": "leadership and performance",
      "relationships": "romance and drama",
      "health": "vitality and heart",
      "spirituality": "divine creativity",
      "personal_growth": "self-expression"
    },
    "compatible_signs": ["aries", "sagittarius", "gemini", "libra", "aquarius"],
    "description": "Leo embodies the archetype of the Sovereign and Creator—the radiant, noble force that inspires through authentic self-expression and warm-hearted leadership. As a fire sign ruled by the Sun, Leo represents the principle of vitality, generosity, and the creative spark that brings joy and meaning to life. Leo possesses natural charisma, dramatic flair, and a childlike enthusiasm that naturally draws others into their sphere of influence. While sometimes prideful or attention-seeking, Leo's greatest gifts lie in their ability to inspire loyalty, celebrate life's grand moments, and awaken creative potential through their genuine warmth, courage, and magnanimous spirit."
  },
  "virgo": {
    "element": "earth",
    "modality": "mutable",
    "ruling_planet": "mercury",
    "keywords": ["analytical", "precise", "practical", "diligent", "discerning", "improvement-oriented"],
    "focus": "Refinement, service, and practical mastery",
    "qualities": {
      "general": "analytical and practical",
      "career": "attention to detail",
      "relationships": "service and improvement",
      "health": "health consciousness",
      "spirituality": "practical spirituality",
      "personal_growth": "self-improvement"
    },
    "compatible_signs": ["taurus", "capricorn", "cancer", "scorpio", "pisces"],
    "description": "Virgo embodies the archetype of the Craftsman and Healer—the discerning, methodical force that refines, purifies, and improves through humble service and attention to detail. As an earth sign ruled by Mercury, Virgo represents the principle of analysis, discrimination, and the sacred work of bringing order to chaos. Virgo possesses exceptional precision, practical intelligence, and a natural inclination toward wellness that seeks to integrate mind, body, and environment. While sometimes critical or perfectionistic, Virgo's greatest gifts lie in their ability to identify solutions, improve systems, and offer practical help through their analytical skills, dedication to excellence, and devotion to service."
  },
  "libra": {
    "element": "air",
    "modality": "cardinal",
    "ruling_planet": "venus",
    "keywords": ["harmonizing", "diplomatic", "fair-minded", "refined", "partnership-oriented", "aesthetic"],
    "focus": "Balance, relationships, and aesthetic harmony",
    "qualities": {
      "general": "harmonious and diplomatic",
      "career": "partnerships and balance",
      "relationships": "harmony and fairness",
      "health": "balance and beauty",
      "spirituality": "spiritual harmony",
      "personal_growth": "self-balance"
    },
    "compatible_signs": ["gemini", "aquarius", "leo", "sagittarius", "aries"],
    "description": "Libra embodies the archetype of the Diplomat and Artist—the harmonizing, relational force that seeks balance, beauty, and justice in all exchanges. As an air sign ruled by Venus, Libra represents the principle of reciprocity, aesthetics, and the dance of relationship that mirrors the self through others. Libra possesses natural charm, diplomatic skill, and an innate sense of fairness that carefully weighs different perspectives before making decisions. While sometimes indecisive or conflict-avoidant, Libra's greatest gifts lie in their ability to create harmony, appreciate beauty, and establish justice through their refined social intelligence, artistic sensibility, and commitment to balanced exchange."
  },
  "scorpio": {
    "element": "water",
    "modality": "fixed",
    "ruling_planet": "pluto",
    "keywords": ["intense", "magnetic", "penetrating", "transformative", "private", "resourceful"],
    "focus": "Transformation, psychological depth, and shared resources",
    "qualities": {
      "general": "intense and transformative",
      "career": "investigation and power",
      "relationships": "depth and passion",
      "health": "regeneration",
      "spirituality": "occult wisdom",
      "personal_growth": "self-transformation"
    },
    "compatible_signs": ["cancer", "pisces", "virgo", "capricorn", "taurus"],
    "description": "Scorpio embodies the archetype of the Shaman and Detective—the penetrating, transformative force that explores hidden realms, confronts shadows, and catalyzes profound rebirth. As a water sign traditionally ruled by Mars and modernly by Pluto, Scorpio represents the principle of depth, power, and the evolutionary cycle of death and regeneration. Scorpio possesses exceptional emotional intensity, psychological insight, and magnetic presence that can sense the underlying truth beneath surface appearances. While sometimes secretive or controlling, Scorpio's greatest gifts lie in their ability to facilitate healing, access hidden resources, and navigate transformative passages through their emotional courage, unflinching honesty, and capacity for profound intimacy."
  },
  "sagittarius": {
    "element": "fire",
    "modality": "mutable",
    "ruling_planet": "jupiter",
    "keywords": ["visionary", "expansive", "adventurous", "philosophical", "optimistic", "freedom-loving"],
    "focus": "Expansion, wisdom, and exploration of life's greater meaning",
    "qualities": {
      "general": "adventurous and philosophical",
      "career": "expansion and learning",
      "relationships": "freedom and growth",
      "health": "optimism and activity",
      "spirituality": "higher learning",
      "personal_growth": "self-discovery"
    },
    "compatible_signs": ["aries", "leo", "libra", "aquarius", "gemini"],
    "description": "Sagittarius embodies the archetype of the Explorer and Philosopher—the expansive, visionary force that seeks truth, meaning, and adventure beyond conventional boundaries. As a fire sign ruled by Jupiter, Sagittarius represents the principle of growth, wisdom, and the quest for understanding that connects individual experience to universal truth. Sagittarius possesses natural optimism, intellectual curiosity, and a far-reaching vision that inspires others to broaden their horizons. While sometimes blunt or restless, Sagittarius' greatest gifts lie in their ability to inspire hope, synthesize diverse perspectives, and expand consciousness through their genuine enthusiasm, philosophical insight, and courageous pursuit of truth."
  },
  "capricorn": {
    "element": "earth",
    "modality": "cardinal",
    "ruling_planet": "saturn",
    "keywords": ["ambitious", "disciplined", "responsible", "strategic", "persistent", "dignified"],
    "focus": "Achievement, structure, and mastery through time",
    "qualities": {
      "general": "ambitious and disciplined",
      "career": "achievement and structure",
      "relationships": "commitment and tradition",
      "health": "endurance and bones",
      "spirituality": "practical wisdom",
      "personal_growth": "self-mastery"
    },
    "compatible_signs": ["taurus", "virgo", "scorpio", "pisces", "cancer"],
    "description": "Capricorn embodies the archetype of the Builder and Elder—the disciplined, enduring force that creates lasting structures and transmits wisdom through lineage and tradition. As an earth sign ruled by Saturn, Capricorn represents the principle of maturation, responsibility, and the patient climb toward mastery that requires facing limitations and overcoming obstacles. Capricorn possesses exceptional ambition, strategic intelligence, and quiet dignity that approaches life as a long-term investment. While sometimes overly serious or status-conscious, Capricorn's greatest gifts lie in their ability to build enduring legacies, establish solid foundations, and model integrity through their disciplined approach, practical wisdom, and commitment to excellence."
  },
  "aquarius": {
    "element": "air",
    "modality": "fixed",
    "ruling_planet": "uranus",
    "keywords": ["progressive", "humanitarian", "inventive", "independent", "original", "community-minded"],
    "focus": "Innovation, social vision, and liberation from conditioning",
    "qualities": {
      "general": "innovative and humanitarian",
      "career": "originality and technology",
      "relationships": "friendship and independence",
      "health": "circulation and innovation",
      "spirituality": "universal consciousness",
      "personal_growth": "self-liberation"
    },
    "compatible_signs": ["gemini", "libra", "sagittarius", "aries", "leo"],
    "description": "Aquarius embodies the archetype of the Revolutionary and Visionary—the progressive, innovative force that perceives future possibilities and catalyzes collective evolution. As an air sign traditionally ruled by Saturn and modernly by Uranus, Aquarius represents the principle of liberation, originality, and the higher mind that accesses universal patterns beyond conventional thinking. Aquarius possesses natural objectivity, inventive genius, and humanitarian values that seek to improve life for the collective. While sometimes detached or eccentric, Aquarius' greatest gifts lie in their ability to catalyze progress, envision future paradigms, and create social innovation through their independent thinking, technological aptitude, and commitment to principles of equality and freedom."
  },
  "pisces": {
    "element": "water",
    "modality": "mutable",
    "ruling_planet": "neptune",
    "keywords": ["empathic", "imaginative", "spiritual", "compassionate", "artistic", "boundary-dissolving"],
    "focus": "Transcendence, mystical connection, and dissolving separation",
    "qualities": {
      "general": "intuitive and compassionate",
      "career": "creativity and service",
      "relationships": "empathy and romance",
      "health": "immune system and feet",
      "spirituality": "mystical connection",
      "personal_growth": "self-transcendence"
    },
    "compatible_signs": ["cancer", "scorpio", "taurus", "capricorn", "virgo"],
    "description": "Pisces embodies the archetype of the Mystic and Artist—the transcendent, empathic force that dissolves boundaries between worlds and accesses the collective unconscious. As a water sign traditionally ruled by Jupiter and modernly by Neptune, Pisces represents the principle of unity, spiritual connection, and the merging of individual consciousness with the universal ocean of being. Pisces possesses exceptional compassion, creative imagination, and intuitive sensitivity that perceives subtle energies and unspoken feelings. While sometimes escapist or boundary-challenged, Pisces' greatest gifts lie in their ability to heal through compassion, inspire through artistic vision, and access mystical dimensions through their emotional receptivity, creative imagination, and unconditional love."
  }
} 